#### `terraform plan` Success
<details><summary>Show Output</summary>

```

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.aws-route-53.aws_route53_record.galaxyletter_com_A will be created
  + resource "aws_route53_record" "galaxyletter_com_A" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "galaxyletter.com"
      + type            = "A"
      + zone_id         = (known after apply)

      + alias {
          + evaluate_target_health = false
          + name                   = "d2u1ftrxn4zlf1.cloudfront.net"
          + zone_id                = "Z2FDTNDATAQYW2"
        }
    }

  # module.aws-route-53.aws_route53_record.galaxyletter_com_NS will be created
  + resource "aws_route53_record" "galaxyletter_com_NS" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "galaxyletter.com"
      + records         = (known after apply)
      + ttl             = 172800
      + type            = "NS"
      + zone_id         = (known after apply)
    }

  # module.aws-route-53.aws_route53_record.www_galaxyletter_com_CNAME will be created
  + resource "aws_route53_record" "www_galaxyletter_com_CNAME" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "www.galaxyletter.com"
      + records         = [
          + "galaxyletter.github.io",
        ]
      + ttl             = 300
      + type            = "CNAME"
      + zone_id         = (known after apply)
    }

  # module.aws-route-53.aws_route53_zone.galaxyletter will be created
  + resource "aws_route53_zone" "galaxyletter" {
      + comment       = "Managed by Terraform"
      + force_destroy = false
      + id            = (known after apply)
      + name          = "galaxyletter.com"
      + name_servers  = (known after apply)
      + vpc_id        = (known after apply)
      + vpc_region    = (known after apply)
      + zone_id       = (known after apply)
    }

Plan: 4 to add, 0 to change, 0 to destroy.
```

</details>

*Workflow: `Terraform Pull Request`, Action: `hashicorpterraform-github-actions4`, Working Directory: `.`*
